:PROPERTIES:
:ID:       711d6a41-5425-4853-97ed-f7698a4a3605
:END:
#+title: LSP

***** LSP Caps

#+name: jqLspCaps
#+begin_src jq :in-file hyprls-client-caps.json :cmd-line -r :var maxDepth=2 key="textDocument"
# #+begin_src jq :in-file hyprls-client-caps.json :cmd-line -r :var maxDepth=1
# [.. | paths(type == "object")
#     | select(length <= ($maxDepth | tonumber))]
#   | map(join("/")) # | length

[."\($key)" | paths(type == "object" or type == "array")
    | select(length <= ($maxDepth | tonumber))]
#  | map([$key] + .)
  | map(join("/"))
#+end_src

#+RESULTS: jqLspCaps
#+begin_example
[
  "declaration",
  "definition",
  "references",
  "implementation",
  "typeDefinition",
  "synchronization",
  "documentSymbol",
  "documentSymbol/symbolKind",
  "formatting",
  "rangeFormatting",
  "onTypeFormatting",
  "rename",
  "codeAction",
  "codeAction/codeActionLiteralSupport",
  "codeAction/resolveSupport",
  "completion",
  "completion/completionItem",
  "signatureHelp",
  "signatureHelp/signatureInformation",
  "documentLink",
  "hover",
  "hover/contentFormat",
  "selectionRange",
  "callHierarchy",
  "typeHierarchy",
  "publishDiagnostics",
  "publishDiagnostics/tagSupport",
  "diagnostic",
  "linkedEditingRange"
]
#+end_example

***** LSP Caps Scalars

#+name: jqLspCapsScalar
#+begin_src jq :in-file hyprls-client-caps.json :cmd-line -r :var depth=1 key="textDocument"
[."\($key)" | paths(type == "number" or type == "string")
    | select(length == ($depth | tonumber))]
#  | map([$key] + .)
  | map(join("/"))

  #+end_src

#+RESULTS: jqLspCapsScalar
: []

#+name: jqLspCapsTop
#+call: jqLspCaps(d=1)

***** Query LSP Caps (non-scalar)

#+name: lspCapsTree
#+headers: :results output code :wrap example
#+begin_src shell :var rgx="workspace" q="map(select(test(\"workspace\")))" json=jqLspCaps(maxDepth=3, key="textDocument")
# kinda hard to quote
[[ -n "$rgx" ]] && q="map(select(test(\"$rgx\"; \"i\")))"
echo $json | jq -r ". | $q | join(\"\\n\")" | tree --noreport --fromfile .
#+end_src

#+RESULTS: lspCapsTree
#+begin_example
.
#+end_example

***** Rollup Table

Feelin' kinda cute ... don't wanna scroll...

I'll write a simple table =reshape= in =jq=

#+name: jqRollupTable
#+begin_src jq :cmd-line -r :var w=8 :stdin jqLspCaps :results output table
reduce
  .[] as $el
  ([]; . as $acc
    | ($acc | (map(select(type=="string"))) // []) as $accacc
    | $accacc | length as $accacclen
    | ($acc | map(select(type=="array")) // []) as $assarr
    | if ($accacclen < ($w | tonumber))
      then ($acc + [$el])
      else ($assarr + [$accacc]) end) as $smh
  | [($smh[] | arrays)] + [[$smh[] | strings]] # arrays + strings
#+end_src

#+RESULTS: jqRollupTable
| declaration                        | definition         | references | implementation      | typeDefinition                      | synchronization           | documentSymbol | documentSymbol/symbolKind |
| rangeFormatting                    | onTypeFormatting   | rename     | codeAction          | codeAction/codeActionLiteralSupport | codeAction/resolveSupport | completion     | completion/completionItem |
| signatureHelp/signatureInformation | documentLink       | hover      | hover/contentFormat | selectionRange                      | callHierarchy             | typeHierarchy  | publishDiagnostics        |
| diagnostic                         | linkedEditingRange |            |                     |                                     |                           |                |                           |

JQ is like a crazy "choose your own adventure" into "double-after spree" (...
don't worry: I'm licensed to use non-sequitors and I know what I'm doing)

#+begin_example jq :cmd-line -r :var w=8 :stdin jqLspCaps :results output table
.WTF #?

# produces integers for final strings
| (($smh | arrays) + ($smh + strings))

# produces nothing
| (($smh[] | arrays) + ($smh[] + strings))
| (($smh | arrays) + ($smh[] + strings))

# indivudually ⮦(arrays) (strings)⮧
| ([$smh[] | arrays] + [$smh[] | strings]) # but, together? ....... NOTHING

# produces: [[8], [8], [8], [8], [1], [1], [1], [1], [1]]
| ($smh[] | ([arrays] + [strings]))

# produces Array(div(n,8) + mod(n,8)) ..... of empty arrays
| ($smh[] | ([arrays + strings]))

# inserts (strings)⮧ into each copy of ⮦(arrays)
| [$smh[] | strings] + ($smh[] | arrays)

# ........... Here's the random combination
| [($smh[] | arrays)] + [[$smh[] | strings]] # arrays + strings

# WTF JQ
# ["a" "b" "c" ] | strings # => DAMIT
# {"foo": { "a": "b", "3": "4"}, "bar": {}} | strings #  | length
#        ([]; . as $acc | ($acc | strings // []) | length as $acclen | $acc + [$acclen | tostring])

# ... I suspected jq may do each thing that went wrong... but somehow, each
# thing still happened.
#+end_example
**** Server

#+name: jqHyprServerCaps
#+headers: :results output code :wrap example json
#+begin_src jq :cmd-line -r :in-file "hyprls-server-caps.json"
[paths | join("/")]
#+end_src

#+RESULTS: jqHyprServerCaps
#+begin_example json
[
  "textDocumentSync",
  "textDocumentSync/openClose",
  "textDocumentSync/change",
  "completionProvider",
  "hoverProvider",
  "documentSymbolProvider",
  "colorProvider"
]
#+end_example

It doesn't need to do much.

#+call: lspCapsTree(rgx=".*", json=jqHyprServerCaps)

#+RESULTS:
#+begin_example
.
├── colorProvider
├── completionProvider
├── documentSymbolProvider
├── hoverProvider
└── textDocumentSync
    ├── change
    └── openClose
#+end_example

Applying the same =jq= functionality to get =jqLspServerCaps=.

#+name: jqLspServerCaps
#+call: jqLspCaps(maxDepth=3, key="textDocument") :in-file "hyprls-server-caps.json" :results output code :wrap example json

#+RESULTS: jqLspServerCaps
#+begin_example json
[]
#+end_example

